export const LevelCheckData = [
  {
    id: 1,
    title: "포핸드",
    level: [
      {
        grade: 1.5,
        desc: "L 1.5 이하 | 포핸드가 뭔지 몰라요",
      },
      {
        grade: 2.0,
        desc: "L 2.0 | 방향 조절이 어렵고, 스윙이 완벽하지 않아요",
      },
      {
        grade: 2.5,
        desc: "L 2.5 | 스윙 자세가 일정해지고, 날아오는 공에 대한 준비가 되어 있어요",
      },
      {
        grade: 3.0,
        desc: "L 3.0 | 깊이에 대한 조절능력이 부족해요 ",
      },
      {
        grade: 3.5,
        desc: "L 3.5 | 공에 스핀을 넣을 수 있어요",
      },
      {
        grade: 4.0,
        desc: "L 4.0 | 공의 깊이와 방향을 컨트롤 할 수 있어요",
      },
      {
        grade: 4.5,
        desc: "L 4.5 | 어려운 상황에서도 강한 샷이 가능해요",
      },
      {
        grade: 5.0,
        desc: "L 5.0 | 연속적으로 여러가지 볼을 배합할 수 있으며, 좋은 타구감을 가지고 있으며 패싱샷이 안정적이에요",
      },
      {
        grade: 5.5,
        desc: "L 5.5 | 게임에 대한 예측력을 가지고, 힘든 상황에서도 좋은 샷을 칠 수 있어요",
      },
      {
        grade: 6.0,
        desc: "L 6.0 이상 | 랭킹을 인정받은 선수예요",
      },
    ],
  },
  {
    id: 2,
    title: "백핸드",
    level: [
      {
        grade: 1.5,
        desc: "L 1.5 이하 | 백핸드가 뭔지 몰라요",
      },
      {
        grade: 2.0,
        desc: "L 2.0 | 방향 조절이 어렵고, 스윙이 완벽하지 않아요",
      },
      {
        grade: 2.5,
        desc: "L 2.5 | 그립과 준비자세에 문제가 있고, 백핸드 대신 포핸드로 치는 선택을 자주해요",
      },
      {
        grade: 3.0,
        desc: "L 3.0 | 준비동작이 제대로 되고, 일반적인 공은 어느정도 꾸준히 칠 수 있어요",
      },
      {
        grade: 3.5,
        desc: "L 3.5 | 일반적인 공에 대해 방향 조절이 가능하지만, 어려운 공에 대해서는 방어적이에요",
      },
      {
        grade: 4.0,
        desc: "L 4.0 | 일반적인 공에 대해 방향, 깊이 조절이 가능하며, 스핀을 넣기 시작해요",
      },
      {
        grade: 4.5,
        desc: "L 4.5 | 방향과 깊이를 조절할 수 있고, 일반적인 공에 힘을 실어서 칠 수 있어요",
      },
      {
        grade: 5.0,
        desc: "L 5.0 | 꾸준하게 백핸드로 공격적인 샷을 칠 수 있어요",
      },
      {
        grade: 5.5,
        desc: "L 5.5 | 게임에 대한 예측력을 가지고, 힘든 상황에서도 좋은 샷을 칠 수 있어요",
      },
      {
        grade: 6.0,
        desc: "L 6.0 이상 | 랭킹을 인정받은 선수예요",
      },
    ],
  },
  {
    id: 3,
    title: "발리",
    level: [
      {
        grade: 1.5,
        desc: "L 1.5 이하 | 발리가 뭔지 몰라요",
      },
      {
        grade: 2.0,
        desc: "L 2.0 | 네트로 나가는 것을 꺼리고, 백발리를 기피해요",
      },
      {
        grade: 2.5,
        desc: "L 2.5 | 네트플레이 중에서도 특히 백핸드가 불안정해요",
      },
      {
        grade: 3.0,
        desc: "L 3.0 | 낮은 공이나 옆으로 빠지는 공에 대해서 대처를 잘 하지 못해요",
      },
      {
        grade: 3.5,
        desc: "L 3.5 | 적당한 풋워크를 사용하고, 포핸드와 백핸드 발리도 적당히 가능해요",
      },
      {
        grade: 4.0,
        desc: "L 4.0 | 포핸드와 백핸드 모든 방향에 대해 옆으로 깊이 빠지는 공과 낮은 공을 신경쓰기 시작해요",
      },
      {
        grade: 4.5,
        desc: "L 4.5 | 풋워크가 좋으며, 여러 가지 발리를 섞어서 사용해요",
      },
      {
        grade: 5.0,
        desc: "L 5.0 | 상대방의 약점을 노리는 서브가 가능하며, 상대방의 페이스를 흐트리는 리턴도 가능해요",
      },
      {
        grade: 5.5,
        desc: "L 5.5 | 게임에 대한 예측력을 가지고, 힘든 상황에서도 좋은 샷을 칠 수 있어요",
      },
      {
        grade: 6.0,
        desc: "L 6.0 이상 | 랭킹을 인정받은 선수예요",
      },
    ],
  },
  {
    id: 4,
    title: "서브/리턴",
    level: [
      {
        grade: 1.5,
        desc: "L 1.5 이하 | 서브/리턴이 뭔지 몰라요",
      },
      {
        grade: 2.0,
        desc: "L 2.0 | 더블 폴트를 자주하며, 토스도 일정하지 못해 서브 리턴 시 실수를 많이해요",
      },
      {
        grade: 2.5,
        desc: "L 2.5 | 풀스윙 서브를 넣기 시작하고, 느린 속도의 서브는 리턴이 가능해요",
      },
      {
        grade: 3.0,
        desc: "L 3.0 | 서브 리듬에 대해 터득했으며, 서브 리턴을 꾸준히 잘 할 수 있어요.",
      },
      {
        grade: 3.5,
        desc: "L 3.5 | 서브에 회전도 넣을 수 있으며, 일반적인 서브에 대해 방향 조절하며 리턴이 가능해요",
      },
      {
        grade: 4.0,
        desc: "L 4.0 | 퍼스트와 세컨 서브를 원하는 위치에 넣고, 단식과 복식에서 서브 리턴이 안정적이에요",
      },
      {
        grade: 4.5,
        desc: "L 4.5 | 서브에 힘과 회전을 이용하며, 서브 리턴을 공격적으로 할 수 있어요",
      },
      {
        grade: 5.0,
        desc: "L 5.0 | 상대방의 약점을 노리는 서브가 가능하며, 상대방의 페이스를 흐트리는 리턴도 가능해요",
      },
      {
        grade: 5.5,
        desc: "L 5.5 | 항상 공격적인 서브가 가능하며, 상대방의 약점을 파악해 이용할 수 있어요",
      },
      {
        grade: 6.0,
        desc: "L 6.0 이상 | 랭킹을 인정받은 선수예요",
      },
    ],
  },
];
